# ImportExportFileFormat Enumeration (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ImportExportFileFormat Enumeration
See Also
---
Describes formats supported by import / export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2010
# Syntax
C#
---
```text
public enum ImportExportFileFormat
```

Visual Basic
---
```text
Public Enumeration ImportExportFileFormat
```

Visual C++
---
```text
public enum class ImportExportFileFormat
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| DWG | DWG format |
| DWF | DWF format |
| DWFX | DWFX format |
| GBXML | GBXML format |
| FBX | FBX format |
| Image | Image format |
| DGN | DGN format |
| Civil3D | Civel3D format |
| Inventor | Inventor format |
| DXF | DXF format |
| SAT | SAT format |
| IFC | IFC format |
| NWC | Navisworks format |
| PDF | PDF format |
| STL | STL format |
| AXM | AXM format |

# See Also
Autodesk.Revit.DB Namespace